tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Text processing system for reStructuredText
brew "docutils"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go version management
brew "goenv", args: ["HEAD"]
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Internet file retriever
brew "wget"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD", "with-jansson"]
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alacritty"
cask "alfred"
cask "azure-data-studio"
cask "bitwarden"
cask "coconutbattery"
cask "cyberduck"
cask "dash"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "inkscape"
cask "itsycal"
cask "jdownloader"
cask "joplin"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "licecap"
cask "logitech-options"
cask "lulu"
cask "mattermost"
cask "mgba"
cask "notion"
cask "pgadmin4"
cask "protonvpn"
cask "rectangle"
cask "rocket"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "textmate"
cask "upwork"
cask "visual-studio-code"
cask "vlc"
